//
//  subscriptTasksReflect.swift
//  SwiftDeliberate
//
//  Created by Валерия Пономарева on 18.07.2026.
//

import Foundation
/**
 🏆 GOLDEN RULES:
 
 1. Сабскрипт — это доступ через [].
 
 2. ВСЕГДА проверяй индексы через guard или if.
 
 3. Сабскрипт может принимать несколько параметров.
 
 4. Двумерный массив = массив массивов: seats[row][seat].
 
 5. В get — возвращай заглушку при ошибке.
 
 6. В set — просто return при ошибке (без краша).
 
 7. Используй ?? для словарей, чтобы не показывать nil.
 
 «Вложенный массив — это как многоэтажный дом. Чтобы найти человека, сабскрипту нужно сначала зайти на правильный этаж (row), а уже потом открыть дверь нужной квартиры (seat).
 
 ☕️🍩 Синтаксис Swift требует указать оба шага подряд: seats[row][seat]».
 */
